docs(lld/hld): update behavioral & creational design pattern vaults and cross-references
